import { BlockTitle, MyMotion, PageTitle } from '@/components';
import React from 'react';

const about = () => {
  return (
    <MyMotion>
      <section className="container">
        <div className="page-container">
          <div>
            <PageTitle title={'О Компании'} />
          </div>
          <div className="mt-6">
            <div className="border-t-[1px] border-border-color"></div>
            <div className="py-9">
              <div>
                <BlockTitle
                  title="IT-решения для вашего бизнеса от нашей компании"
                  subtitle="Наша компания предлагает вам широкий спектр IT-услуг, включая:"
                />
              </div>
              <div className="flex justify-center py-5">
                <ul className="md:w-[700px] w-full flex flex-col gap-4 list-disc px-2">
                  <li className="">
                    <span className="text-blue">IT-аутсорсинг:</span> мы берем на себя все задачи по
                    обеспечению и поддержке IT-инфраструктуры вашей организации, от установки и
                    настройки оборудования до решения любых технических проблем.
                  </li>
                  <li>
                    <span className="text-blue">Сопровождение 1С:</span> мы предоставляем
                    квалифицированную помощь по работе с программными продуктами 1С, от консультаций
                    и обучения до разработки и внедрения индивидуальных решений.
                  </li>
                  <li>
                    <span className="text-blue">
                      Продажа комплектующих для ПК и серверного оборудования:
                    </span>{' '}
                    мы предлагаем вам выгодные цены и гарантию качества на широкий ассортимент
                    компьютерных и серверных компонентов от ведущих производителей.
                  </li>
                </ul>
              </div>
              <div className="border-t-[1px] border-border-color"></div>
              <div className="py-5">
                <div className="flex items-start gap-2">
                  <span>
                    <svg
                      className="fill-blue inline-block"
                      xmlns="http://www.w3.org/2000/svg"
                      height="20"
                      width="20"
                      viewBox="0 0 512 512">
                      <path d="M256 32c14.2 0 27.3 7.5 34.5 19.8l216 368c7.3 12.4 7.3 27.7 .2 40.1S486.3 480 472 480H40c-14.3 0-27.6-7.7-34.7-20.1s-7-27.8 .2-40.1l216-368C228.7 39.5 241.8 32 256 32zm0 128c-13.3 0-24 10.7-24 24V296c0 13.3 10.7 24 24 24s24-10.7 24-24V184c0-13.3-10.7-24-24-24zm32 224a32 32 0 1 0 -64 0 32 32 0 1 0 64 0z" />
                    </svg>
                  </span>
                  <p>
                    Наша компания имеет многолетний опыт и высокую репутацию в сфере IT-услуг. Мы
                    работаем с клиентами различных отраслей и масштабов, от малого бизнеса до
                    крупных корпораций. Мы готовы предложить вам индивидуальный подход и оптимальные
                    решения для вашего бизнеса.
                  </p>
                </div>
                <div className="flex items-start gap-2 mt-3">
                  <span>
                    <svg
                      className="fill-blue inline-block"
                      xmlns="http://www.w3.org/2000/svg"
                      height="20"
                      width="20"
                      viewBox="0 0 512 512">
                      <path d="M256 48C141.1 48 48 141.1 48 256v40c0 13.3-10.7 24-24 24s-24-10.7-24-24V256C0 114.6 114.6 0 256 0S512 114.6 512 256V400.1c0 48.6-39.4 88-88.1 88L313.6 488c-8.3 14.3-23.8 24-41.6 24H240c-26.5 0-48-21.5-48-48s21.5-48 48-48h32c17.8 0 33.3 9.7 41.6 24l110.4 .1c22.1 0 40-17.9 40-40V256c0-114.9-93.1-208-208-208zM144 208h16c17.7 0 32 14.3 32 32V352c0 17.7-14.3 32-32 32H144c-35.3 0-64-28.7-64-64V272c0-35.3 28.7-64 64-64zm224 0c35.3 0 64 28.7 64 64v48c0 35.3-28.7 64-64 64H352c-17.7 0-32-14.3-32-32V240c0-17.7 14.3-32 32-32h16z" />
                    </svg>
                  </span>
                  <p>
                    Свяжитесь с нами прямо сейчас и получите бесплатную консультацию по любому
                    интересующему вас вопросу. Мы ждем вашего звонка или письма. Наша компания - ваш
                    надежный партнер в мире IT.
                  </p>
                </div>
              </div>
            </div>
            <div className="grid md:grid-cols-4 sm:grid-cols-3 grid-cols-1 gap-3">
              {/*  */}
              <div className="flex flex-col gap-3 px-5 py-6 border border-blue hover:border-border-color transition-all rounded-md shadow-md">
                <div className="w-full">
                  <svg
                    className="fill-blue"
                    xmlns="http://www.w3.org/2000/svg"
                    height="30"
                    width="30"
                    viewBox="0 0 512 512">
                    <path d="M256 0a256 256 0 1 1 0 512A256 256 0 1 1 256 0zM232 120V256c0 8 4 15.5 10.7 20l96 64c11 7.4 25.9 4.4 33.3-6.7s4.4-25.9-6.7-33.3L280 243.2V120c0-13.3-10.7-24-24-24s-24 10.7-24 24z" />
                  </svg>
                </div>
                <h3>Экономим ваше время</h3>
                <p className="text-sm">По Алматы доставка в день заказа, либо на следующий</p>
              </div>
              {/*  */}
              <div className="flex flex-col gap-3 px-5 py-6 border border-blue hover:border-border-color transition-all rounded-md shadow-md">
                <div className="w-full">
                  <svg
                    className="fill-blue"
                    xmlns="http://www.w3.org/2000/svg"
                    height="30"
                    width="30"
                    viewBox="0 0 576 512">
                    <path d="M47.6 300.4L228.3 469.1c7.5 7 17.4 10.9 27.7 10.9s20.2-3.9 27.7-10.9l2.6-2.4C267.2 438.6 256 404.6 256 368c0-97.2 78.8-176 176-176c28.3 0 55 6.7 78.7 18.5c.9-6.5 1.3-13 1.3-19.6v-5.8c0-69.9-50.5-129.5-119.4-141C347 36.5 300.6 51.4 268 84L256 96 244 84c-32.6-32.6-79-47.5-124.6-39.9C50.5 55.6 0 115.2 0 185.1v5.8c0 41.5 17.2 81.2 47.6 109.5zM576 368a144 144 0 1 0 -288 0 144 144 0 1 0 288 0zm-76.7-43.3c6.2 6.2 6.2 16.4 0 22.6l-72 72c-6.2 6.2-16.4 6.2-22.6 0l-40-40c-6.2-6.2-6.2-16.4 0-22.6s16.4-6.2 22.6 0L416 385.4l60.7-60.7c6.2-6.2 16.4-6.2 22.6 0z" />
                  </svg>
                </div>
                <h3>Бережем ваши нервы</h3>
                <p className="text-sm">
                  Аккуратно ведем заказы. Вовремя доставим. Примем товар назад в течение 14 дней без
                  скандалов и экспертиз
                </p>
              </div>
              {/*  */}
              <div className="flex flex-col gap-3 px-5 py-6 border border-blue hover:border-border-color transition-all rounded-md shadow-md">
                <div className="w-full">
                  <svg
                    className="fill-blue"
                    xmlns="http://www.w3.org/2000/svg"
                    height="30"
                    width="30"
                    viewBox="0 0 576 512">
                    <path d="M312 24V34.5c6.4 1.2 12.6 2.7 18.2 4.2c12.8 3.4 20.4 16.6 17 29.4s-16.6 20.4-29.4 17c-10.9-2.9-21.1-4.9-30.2-5c-7.3-.1-14.7 1.7-19.4 4.4c-2.1 1.3-3.1 2.4-3.5 3c-.3 .5-.7 1.2-.7 2.8c0 .3 0 .5 0 .6c.2 .2 .9 1.2 3.3 2.6c5.8 3.5 14.4 6.2 27.4 10.1l.9 .3c11.1 3.3 25.9 7.8 37.9 15.3c13.7 8.6 26.1 22.9 26.4 44.9c.3 22.5-11.4 38.9-26.7 48.5c-6.7 4.1-13.9 7-21.3 8.8V232c0 13.3-10.7 24-24 24s-24-10.7-24-24V220.6c-9.5-2.3-18.2-5.3-25.6-7.8c-2.1-.7-4.1-1.4-6-2c-12.6-4.2-19.4-17.8-15.2-30.4s17.8-19.4 30.4-15.2c2.6 .9 5 1.7 7.3 2.5c13.6 4.6 23.4 7.9 33.9 8.3c8 .3 15.1-1.6 19.2-4.1c1.9-1.2 2.8-2.2 3.2-2.9c.4-.6 .9-1.8 .8-4.1l0-.2c0-1 0-2.1-4-4.6c-5.7-3.6-14.3-6.4-27.1-10.3l-1.9-.6c-10.8-3.2-25-7.5-36.4-14.4c-13.5-8.1-26.5-22-26.6-44.1c-.1-22.9 12.9-38.6 27.7-47.4c6.4-3.8 13.3-6.4 20.2-8.2V24c0-13.3 10.7-24 24-24s24 10.7 24 24zM568.2 336.3c13.1 17.8 9.3 42.8-8.5 55.9L433.1 485.5c-23.4 17.2-51.6 26.5-80.7 26.5H192 32c-17.7 0-32-14.3-32-32V416c0-17.7 14.3-32 32-32H68.8l44.9-36c22.7-18.2 50.9-28 80-28H272h16 64c17.7 0 32 14.3 32 32s-14.3 32-32 32H288 272c-8.8 0-16 7.2-16 16s7.2 16 16 16H392.6l119.7-88.2c17.8-13.1 42.8-9.3 55.9 8.5zM193.6 384l0 0-.9 0c.3 0 .6 0 .9 0z" />
                  </svg>
                </div>
                <h3>Адекватные цены</h3>
                <p className="text-sm">
                  Низкая стоимость товаров - одна из ключевых особенностей нашего магазина. Мы
                  стараемся предложить самые выгодные цены, сохраняя высокий уровень обслуживания.
                </p>
              </div>
              {/*  */}
              <div className="flex flex-col gap-3 px-5 py-6 border border-blue hover:border-border-color transition-all rounded-md shadow-md">
                <div className="w-full">
                  <svg
                    className="fill-blue"
                    xmlns="http://www.w3.org/2000/svg"
                    height="30"
                    width="30"
                    viewBox="0 0 640 512">
                    <path d="M323.4 85.2l-96.8 78.4c-16.1 13-19.2 36.4-7 53.1c12.9 17.8 38 21.3 55.3 7.8l99.3-77.2c7-5.4 17-4.2 22.5 2.8s4.2 17-2.8 22.5l-20.9 16.2L512 316.8V128h-.7l-3.9-2.5L434.8 79c-15.3-9.8-33.2-15-51.4-15c-21.8 0-43 7.5-60 21.2zm22.8 124.4l-51.7 40.2C263 274.4 217.3 268 193.7 235.6c-22.2-30.5-16.6-73.1 12.7-96.8l83.2-67.3c-11.6-4.9-24.1-7.4-36.8-7.4C234 64 215.7 69.6 200 80l-72 48V352h28.2l91.4 83.4c19.6 17.9 49.9 16.5 67.8-3.1c5.5-6.1 9.2-13.2 11.1-20.6l17 15.6c19.5 17.9 49.9 16.6 67.8-2.9c4.5-4.9 7.8-10.6 9.9-16.5c19.4 13 45.8 10.3 62.1-7.5c17.9-19.5 16.6-49.9-2.9-67.8l-134.2-123zM16 128c-8.8 0-16 7.2-16 16V352c0 17.7 14.3 32 32 32H64c17.7 0 32-14.3 32-32V128H16zM48 320a16 16 0 1 1 0 32 16 16 0 1 1 0-32zM544 128V352c0 17.7 14.3 32 32 32h32c17.7 0 32-14.3 32-32V144c0-8.8-7.2-16-16-16H544zm32 208a16 16 0 1 1 32 0 16 16 0 1 1 -32 0z" />
                  </svg>
                </div>
                <h3>Не обманываем покупателей</h3>
                <p className="text-sm">
                  Всегда прозрачные акции и всегда честные скидки. Отзывы о нас пишут только наши
                  покупатели. Мы принципиально публикуем как позитивные, так и негативные.
                </p>
              </div>
              {/*  */}
            </div>
          </div>
        </div>
      </section>
    </MyMotion>
  );
};

export default about;
